<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7b452b7f73128cff034daed5e5dc58d2e30f3f455cd7f9d17540e38edcc227f0","plan_job_ref":"Job Write Terraform Plan to Pull Request #91 at https://github.com/hackforla/devops-security/actions/runs/18926569975","plan_out_hash":"953d0f27565c8a9ef8ac5101e50e0d6c5dad1372fdf2ee83f7890ae280f1826b","plan_hash":"73abdba2118267cd76654837fd5e299a1c2d0340aa16d4c9d3638ddb27ae249a","plan_text_format":"diff","version":"1.49.0","closed":true} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_Ganeshswaminathan1912.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "Ganeshswaminathan1912"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "vrms"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_Ganeshswaminathan1912.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "Ganeshswaminathan1912"
    }

  # module.iam_user_Ganeshswaminathan1912.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (sensitive value)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "Ganeshswaminathan1912"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.iam_oidc_gha_incubator.aws_iam_role.github_actions_oidc,
  on modules/aws-gha-oidc-providers/main.tf line 54, in resource "aws_iam_role" "github_actions_oidc":
  54:   managed_policy_arns = var.policy_arns

managed_policy_arns is deprecated. Use the aws_iam_role_policy_attachment
resource instead. If Terraform should exclusively manage all managed policy
attachments (the current behavior of this argument), use the
aws_iam_role_policy_attachments_exclusive resource as well.
```
</details>

:white_check_mark: Plan applied in [Apply Terraform changes on merge #34](https://github.com/hackforla/devops-security/actions/runs/18927197268)